[
  "obsidian-outliner",
  "table-editor-obsidian",
  "cm-editor-syntax-highlight-obsidian",
  "obsidian-admonition",
  "obsidian-kanban",
  "obsidian-style-settings",
  "calendar",
  "obsidian-annotator",
  "workbench-obsidian",
  "dataview",
  "editing-toolbar",
  "obsidian-rollover-daily-todos",
  "obsidian-excalidraw-plugin",
  "obsidian-git",
  "obsidian-tasks-plugin",
  "obsidian-day-planner",
  "obsidian-reminder-plugin",
  "quickadd",
  "obsidian-hypothesis-plugin",
  "obsidian-plugin-toc",
  "obsidian-linter",
  "obsidian-excel-to-markdown-table",
  "obsidian-file-path-to-uri",
  "language-translator",
  "obsidian-emoji-toolbar",
  "new-tab-default-page",
  "buttons",
  "templater-obsidian",
  "better-word-count",
  "obsidian-checklist-plugin",
  "obsidian-icon-folder",
  "recent-files-obsidian",
  "quick-latex",
  "file-tree-alternative",
  "oz-clear-unused-images",
  "obsidian-html-plugin",
  "obsidian-mind-map",
  "periodic-notes",
  "obsidian-statusbar-pomo"
]