[
  "url-into-selection",
  "obsidian-outliner",
  "table-editor-obsidian",
  "cm-editor-syntax-highlight-obsidian",
  "obsidian-admonition",
  "obsidian-kanban",
  "obsidian-style-settings",
  "calendar",
  "obsidian-annotator",
  "workbench-obsidian",
  "dataview",
  "editing-toolbar",
  "obsidian-rollover-daily-todos",
  "obsidian-excalidraw-plugin",
  "obsidian-git",
  "various-complements",
  "obsidian-tasks-plugin",
  "obsidian-day-planner",
  "obsidian-reminder-plugin",
  "quickadd",
  "obsidian-hypothesis-plugin",
  "obsidian-plugin-toc"
]