#!/bin/bash
# 功能: 运维故障处理界面
# 版本: v0.2
# 作者: 书记
# 联系: superopsmsb.com

# 定制类型数组
monitor_type=(研发 测试 运维)
error_type=(红灯 黄灯 绿灯 灰灯)

# 定制信息类型界面
echo -e "\e[31m\t欢迎使用监控平台
-------------------------------------------
1：研发  2：测试  3：运维
-------------------------------------------\e[0m"

# 定制类型信息逻辑
read -p "请选择问题类型: " monitor_id
case "${monitor_type[${monitor_id}-1]}" in
  "研发")
    echo -e "\e[32m这是研发问题，传递给研发团队\e[0m";;
  "测试")
    echo -e "\e[32m这是测试问题，传递给测试团队\e[0m";;
  "运维")
      # 运维自己处理问题
      # 定制信息类型界面
      echo -e "\e[31m\t欢迎使用监控平台\e[0m"
      echo -e "\e[31m-------------------------------------------\e[0m"
      echo -e "\e[31m1：红灯  2：黄灯  3：绿灯  4：灰灯\e[0m"
      echo -e "\e[31m-------------------------------------------\e[0m"
      read -p "请选择问题故障级别: " error_id
      # 问题级别的处理逻辑
      case "${error_type[${error_id}-1]}" in
        "红灯")
           echo -e "\e[32m这是 紧急故障问题\e[0m";;
        "黄灯")
           echo -e "\e[32m这是 严重故障问题\e[0m";;
        "绿灯")
           echo -e "\e[32m这是 一般故障问题\e[0m";;
        "灰灯")
           echo -e "\e[32m这是 未知故障问题，后续操作处理\e[0m";;
        *)
           echo -e "\e[32m请输入有效的问题故障级别id\e[0m";; 
      esac;;
   *)
       echo -e "\e[32m请输入有效的问题类型id\e[0m";;
esac
